Revit 2027 API
FabricationConfiguration.GetInsulationSpecificationAbbreviation Method
 Gets insulation specification abbreviation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
Public Function GetInsulationSpecificationAbbreviation (
	insulationSpecificationId As Integer
) As String
public:
String^ GetInsulationSpecificationAbbreviation(
	int insulationSpecificationId
)
member GetInsulationSpecificationAbbreviation :
        insulationSpecificationId : int -> string
Parameters
insulationSpecificationId Int32
 The insulation specification identifier.
Return Value
String
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace